; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 4)
	(= (value c1) 14)
	(= (value c2) 44)
	(= (value c3) 88)
	(= (value c4) 47)
	(= (value c5) 68)
	(= (value c6) 23)
	(= (value c7) 88)
	(= (value c8) 49)
	(= (value c9) 54)
	(= (value c10) 96)
	(= (value c11) 58)
	(= (value c12) 54)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 12
2. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 12
3. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 12
4. (increment c12)
   changed: (value c12) from 54 to 57
   goals met: 7 of 12
5. (increment c12)
   changed: (value c12) from 57 to 60
   goals met: 8 of 12
6. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 12
7. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 12
8. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 8 of 12
9. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 8 of 12
10. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 8 of 12
11. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 8 of 12
12. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 12
13. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 8 of 12
14. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 12
15. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 8 of 12
16. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 8 of 12
17. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 8 of 12
18. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 8 of 12
19. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 8 of 12
20. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 12
21. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 12
22. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 8 of 12
23. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 8 of 12
24. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 8 of 12
25. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 12
26. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 12
27. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 8 of 12
28. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 8 of 12
29. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 8 of 12
30. (increment c11)
   changed: (value c11) from 58 to 66
   goals met: 7 of 12
31. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 12
32. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 12
33. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 7 of 12
34. (increment c11)
   changed: (value c11) from 66 to 75
   goals met: 7 of 12
35. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 7 of 12
36. (increment c12)
   changed: (value c12) from 60 to 63
   goals met: 7 of 12
37. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 12
38. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 12
39. (increment c8)
   changed: (value c8) from 49 to 56
   goals met: 6 of 12
40. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 6 of 12
41. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 6 of 12
42. (increment c8)
   changed: (value c8) from 56 to 65
   goals met: 6 of 12
43. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 6 of 12
44. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 12
45. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 12
46. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 6 of 12
47. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 12
48. (increment c4)
   changed: (value c4) from 47 to 54
   goals met: 6 of 12
49. (increment c4)
   changed: (value c4) from 54 to 61
   goals met: 6 of 12
50. (increment c4)
   changed: (value c4) from 61 to 68
   goals met: 5 of 12
51. (increment c4)
   changed: (value c4) from 68 to 75
   goals met: 5 of 12
52. (increment c4)
   changed: (value c4) from 75 to 82
   goals met: 5 of 12
53. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 5 of 12
54. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 5 of 12
55. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 5 of 12
56. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 5 of 12
57. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 12
58. (decrement c3)
   changed: (value c3) from 88 to 84
   goals met: 5 of 12
59. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 12
60. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 12
61. (decrement c10)
   changed: (value c10) from 96 to 92
   goals met: 5 of 12
62. (decrement c10)
   changed: (value c10) from 92 to 88
   goals met: 5 of 12
63. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 5 of 12
64. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 5 of 12
65. (decrement c7)
   changed: (value c7) from 88 to 83
   goals met: 5 of 12
66. (decrement c7)
   changed: (value c7) from 83 to 78
   goals met: 5 of 12
67. (decrement c7)
   changed: (value c7) from 78 to 73
   goals met: 5 of 12
68. (decrement c7)
   changed: (value c7) from 73 to 68
   goals met: 5 of 12
69. (decrement c7)
   changed: (value c7) from 68 to 63
   goals met: 6 of 12
70. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 12
71. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 12
72. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 12
73. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 12
74. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 12
75. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 12
76. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 6 of 12
77. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 6 of 12
78. (increment c6)
   changed: (value c6) from 23 to 31
   goals met: 6 of 12
79. (increment c6)
   changed: (value c6) from 31 to 39
   goals met: 6 of 12
80. (increment c6)
   changed: (value c6) from 39 to 47
   goals met: 6 of 12
81. (increment c6)
   changed: (value c6) from 47 to 55
   goals met: 6 of 12
82. (increment c6)
   changed: (value c6) from 55 to 63
   goals met: 5 of 12
83. (increment c6)
   changed: (value c6) from 63 to 71
   goals met: 6 of 12
84. (increment c9)
   changed: (value c9) from 54 to 56
   goals met: 6 of 12
85. (increment c7)
   changed: (value c7) from 63 to 68
   goals met: 5 of 12
86. (decrement c8)
   changed: (value c8) from 65 to 55
   goals met: 6 of 12
87. (decrement c6)
   changed: (value c6) from 71 to 63
   goals met: 6 of 12
88. (decrement c10)
   changed: (value c10) from 88 to 84
   goals met: 6 of 12
89. (decrement c10)
   changed: (value c10) from 84 to 80
   goals met: 6 of 12
90. (decrement c10)
   changed: (value c10) from 80 to 76
   goals met: 6 of 12
91. (decrement c10)
   changed: (value c10) from 76 to 72
   goals met: 7 of 12
92. (increment c12)
   changed: (value c12) from 63 to 66
   goals met: 7 of 12
93. (decrement c11)
   changed: (value c11) from 75 to 65
   goals met: 7 of 12
94. (decrement c10)
   changed: (value c10) from 72 to 68
   goals met: 7 of 12
95. (decrement c10)
   changed: (value c10) from 68 to 64
   goals met: 8 of 12
96. (decrement c4)
   changed: (value c4) from 72 to 62
   goals met: 9 of 12
97. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 9 of 12
98. (decrement c3)
   changed: (value c3) from 84 to 79
   goals met: 9 of 12
99. (decrement c3)
   changed: (value c3) from 79 to 74
   goals met: 9 of 12
100. (increment c4)
   changed: (value c4) from 62 to 72
   goals met: 8 of 12
101. (decrement c3)
   changed: (value c3) from 74 to 69
   goals met: 9 of 12
102. (decrement c4)
   changed: (value c4) from 72 to 62
   goals met: 9 of 12
103. (decrement c3)
   changed: (value c3) from 69 to 64
   goals met: 9 of 12
104. (decrement c3)
   changed: (value c3) from 64 to 59
   goals met: 10 of 12
105. (increment c6)
   changed: (value c6) from 63 to 71
   goals met: 10 of 12
106. (increment c7)
   changed: (value c7) from 68 to 73
   goals met: 11 of 12
107. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 11 of 12
108. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 11 of 12
109. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 12
110. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 11 of 12
111. (increment c8)
   changed: (value c8) from 55 to 65
   goals met: 10 of 12
112. (increment c9)
   changed: (value c9) from 56 to 58
   goals met: 10 of 12
113. (increment c9)
   changed: (value c9) from 58 to 60
   goals met: 10 of 12
114. (increment c9)
   changed: (value c9) from 60 to 62
   goals met: 10 of 12
115. (increment c9)
   changed: (value c9) from 62 to 64
   goals met: 9 of 12
116. (increment c10)
   changed: (value c10) from 64 to 68
   goals met: 9 of 12
117. (increment c11)
   changed: (value c11) from 65 to 75
   goals met: 9 of 12
118. (increment c12)
   changed: (value c12) from 66 to 69
   goals met: 9 of 12
119. (increment c12)
   changed: (value c12) from 69 to 72
   goals met: 9 of 12
120. (increment c12)
   changed: (value c12) from 72 to 75
   goals met: 9 of 12
121. (increment c12)
   changed: (value c12) from 75 to 78
   goals met: 10 of 12
122. (increment c9)
   changed: (value c9) from 64 to 66
   goals met: 11 of 12
123. (increment c8)
   changed: (value c8) from 65 to 75
   goals met: 11 of 12
124. (increment c9)
   changed: (value c9) from 66 to 68
   goals met: 10 of 12
125. (increment c10)
   changed: (value c10) from 68 to 72
   goals met: 11 of 12
126. (increment c9)
   changed: (value c9) from 68 to 70
   goals met: 11 of 12
127. (increment c9)
   changed: (value c9) from 70 to 72
   goals met: 10 of 12
128. (increment c10)
   changed: (value c10) from 72 to 76
   goals met: 10 of 12
129. (increment c11)
   changed: (value c11) from 75 to 85
   goals met: 10 of 12
130. (increment c12)
   changed: (value c12) from 78 to 81
   goals met: 10 of 12
131. (increment c12)
   changed: (value c12) from 81 to 84
   goals met: 10 of 12
132. (increment c12)
   changed: (value c12) from 84 to 87
   goals met: 11 of 12
133. (increment c9)
   changed: (value c9) from 72 to 74
   goals met: 11 of 12
134. (increment c9)
   changed: (value c9) from 74 to 76
   goals met: 11 of 12
135. (increment c10)
   changed: (value c10) from 76 to 80
   goals met: 12 of 12
